# Dockerfile

# 1. Используем официальный, легкий образ Python
FROM python:3.11-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем список зависимостей и устанавливаем их
# Этот шаг кэшируется, чтобы не переустанавливать все каждый раз
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем весь остальной код нашего приложения
COPY . .

# 5. Указываем команду, которая должна запускаться при старте контейнера
CMD ["python", "main.py"]